In [1]:
#dependencies

import pandas as pd

In [4]:
#Use Pandas to read data
age_data = pd.read_csv("../Resources/Age_Data.csv")

In [5]:
#print to view
age_data.head()

   Unnamed: 0  Year        City        Age Range  Number in Range
0           0  2018  Albany, NY   18 to 24 Years            21091
1           1  2018  Albany, NY  75 Years & Over             5906
2           2  2018  Albany, NY   45 to 54 Years            10514
3           3  2018  Albany, NY    Under 5 Years             5491
4           4  2018  Albany, NY   65 to 74 Years             6670

In [ ]:
#look for missing values
#awesome to see!
age_data.count()

In [6]:
#get a list of all of our columns for easy reference
age_data.columns

Index(['Unnamed: 0', 'Year', 'City', 'Age Range', 'Number in Range'], dtype='object')

In [7]:
#collect data that includes year 2016 & age of 25-34
#'Year' = 2016
#'Age Range' = 25 t0 34 Years

age_data_2016_df = age_data.loc[(age_data["Year"] == 2016) & (age_data["Age Range"] == "25 to 34 Years")]

In [8]:
#print
age_data_2016_df.head()

     Unnamed: 0  Year        City       Age Range  Number in Range
32           32  2016  Albany, NY  25 to 34 Years            16205
98           98  2016  Albany, NY  25 to 34 Years            16205
164         164  2016  Albany, NY  25 to 34 Years            16205
230         230  2016  Albany, NY  25 to 34 Years            16205
296         296  2016  Albany, NY  25 to 34 Years            16205

In [9]:
#export DF into a .csv
age_data_2016_df.to_csv("2016_age_data_all_cities.csv")